[
	{
		"title:":"Blurb of the Week",
		"date":"August 13, 2025",
		"article_title":"Chinese ‘overkill’ in dispute with Philippines damaged two Chinese ships. Why it could have been much worse",
		"article_link": "https://edition.cnn.com/2025/08/11/asia/south-china-sea-china-warship-collision-intl-hnk",
		"commentary":"In a rare self-inflicted blunder, a Chinese coast guard cutter chasing a Philippine vessel near Scarborough Shoal collided with its own navy destroyer—crippling the smaller ship. Manila called the incident reckless and reaffirmed its resolve to defend its fishermen and maritime rights."
	},
	{
		"title:":"Blurb of the Week",
		"date":"August 10, 2025",
		"article_title":"World Bank Director: 'I Saw the Craziest Things in China'",
		"article_link": "https://youtu.be/bCnMz0Kx2f8",
		"commentary":"First-hand accounts from foreign executives in China reveal how the country’s trajectory shifted from open curiosity to calculated competition. What began in the early 2000s as polite engagement and knowledge exchange evolved into widespread intellectual property theft, aggressive deal manipulation, and a systemic willingness to cut corners—even in life-and-death matters like infant formula safety. These experiences underscore a deeper concern: when a society’s moral framework is stripped away and replaced solely with the pursuit of power and success, the rules become whatever serves the end goal. China’s rise is not just an economic story—it’s a warning about what happens when ambition is untethered from ethics."
	},
	{
		"title:":"Blurb of the Week",
		"date":"July 28, 2025",
		"article_title":"Filipino resiliance overcomes all adversity",
		"article_link": "https://www.youtube.com/shorts/9_9p9N-5IQ8",
		"commentary":"Filipino core indeed"
	},
	{
		"title:": "Blurb of the Week",
		"date": "May 5, 2025",
		"article_title": "PAGPAG - Eating Trash to Survive 🇵🇭",
		"article_link": "https://youtu.be/XLhI0w2iu5Y?si=8jLJ4ONoTrAK7EGJ",
		"commentary": "This powerful short doc follows Frenchie, a foreign content creator, as he traces the life cycle of Pagpag — recycled fast food collected from Jollibee and McDonald’s trash bins, washed, cooked, and resold in the slums of Tondo, Manila. From speaking with street vendors to riding garbage trucks into “Happyland,” he uncovers how poverty forces thousands to survive on what others throw away. Both heartbreaking and deeply human, this video sheds light on the invisible food chain feeding the city’s poorest — and the dignity they maintain despite it."
	},
	{
		"title:": "Blurb of the Week",
		"date": "April 19, 2025",
		"article_title": "World's first humanoid robot half-marathon held in Beijing",
		"article_link": "https://www.youtube.com/shorts/32fR4ankcus",
		"commentary": "I like the little guys at the end, hehe"
	},
	{
		"title:": "Blurb of the Week",
		"date": "April 15, 2025",
		"article_title": "Duterte praise, PH election spin driven by fake accounts – study",
		"article_link": "https://www.inquirer.net/436643/duterte-praise-ph-election-spin-driven-by-fake-accounts-study/",
		"commentary": "Fake accounts, real damage. The pro-Duterte noise machine isn't grassroots — it’s a ghost army. AI now confirms what many suspected: a deliberate network of bots flooding social media to rewrite the narrative, paint Duterte as the victim, and manipulate midterm election discourse. The Philippines has become the testing ground for digital black ops. If we don’t wise up, we’ll keep voting in shadows, not leaders."
	},
	{
		"title:": "Blurb of the Week",
		"date": "April 7, 2025",
		"article_title": "How Tribalism on Mindanao Influences the Internal Security Environment",
		"article_link": "https://www.inquirer.net/435327/moros-decry-racist-slur-by-governor/?utm_medium=gallery&utm_source=(direct)",
		"commentary": "A recent statement by a Philippine governor has sparked outrage among Moros, who decry the remarks as a racist slur. The controversy sheds light on long-standing ethnic tensions and the need for more respectful discourse in political leadership."
	},
	{
		"title:": "Blurb of the Week",
		"date": "March 27, 2025",
		"article_title": "Lee Kwan Yew's Warning to the Philippines from the Past",
		"article_link": "https://www.youtube.com/watch?v=pD2I8q3guHI",
		"commentary": "He saw a nation rich in talent, cursed by a culture that forgives failure and rewards corruption. While Singapore enforced discipline, the Philippines let clowns and crooks recycle power. We were ahead of South Korea once. Now we export our best people and re-elect our worst. His warning wasn’t prophecy. It was common sense. We just refused to listen. Click the discover button to watch the full video. 👇"
	}
]
