[
	{
		"title:": "Blurb of the Week",
		"date": "April 19, 2025",
		"article_title": "World's first humanoid robot half-marathon held in Beijing",
		"article_link": "https://www.youtube.com/shorts/32fR4ankcus",
		"commentary": "I like the little guys at the end, hehe"
	},
	{
		"title:": "Blurb of the Week",
		"date": "April 15, 2025",
		"article_title": "Duterte praise, PH election spin driven by fake accounts – study",
		"article_link": "https://www.inquirer.net/436643/duterte-praise-ph-election-spin-driven-by-fake-accounts-study/",
		"commentary": "Fake accounts, real damage. The pro-Duterte noise machine isn't grassroots — it’s a ghost army. AI now confirms what many suspected: a deliberate network of bots flooding social media to rewrite the narrative, paint Duterte as the victim, and manipulate midterm election discourse. The Philippines has become the testing ground for digital black ops. If we don’t wise up, we’ll keep voting in shadows, not leaders."
	},
	{
		"title:": "Blurb of the Week",
		"date": "April 7, 2025",
		"article_title": "How Tribalism on Mindanao Influences the Internal Security Environment",
		"article_link": "https://www.inquirer.net/435327/moros-decry-racist-slur-by-governor/?utm_medium=gallery&utm_source=(direct)",
		"commentary": "A recent statement by a Philippine governor has sparked outrage among Moros, who decry the remarks as a racist slur. The controversy sheds light on long-standing ethnic tensions and the need for more respectful discourse in political leadership."
	},
	{
		"title:": "Blurb of the Week",
		"date": "March 27, 2025",
		"article_title": "Lee Kwan Yew's Warning to the Philippines from the Past",
		"article_link": "https://www.youtube.com/watch?v=pD2I8q3guHI",
		"commentary": "He saw a nation rich in talent, cursed by a culture that forgives failure and rewards corruption. While Singapore enforced discipline, the Philippines let clowns and crooks recycle power. We were ahead of South Korea once. Now we export our best people and re-elect our worst. His warning wasn’t prophecy. It was common sense. We just refused to listen. Click the discover button to watch the full video. 👇"
	}
]
